AntwerpDesignsIonity/Wifi_Dongle_ESP/firmware/sdkconfig.defaults
# ESP32-S3-N16R8 WiFi Dongle — sdkconfig defaults
# Applied before project-level configuration, can be overridden by sdkconfig.

# ---------------------------------------------------------------------------
# Chip / Flash
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---------------------------------------------------------------------------
# Partition table
# ---------------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16MB.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------
# PSRAM  (N16R8 has 8 MB OPI PSRAM)
# ---------------------------------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ---------------------------------------------------------------------------
# CPU speed
# ---------------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---------------------------------------------------------------------------
# USB / TinyUSB
# ---------------------------------------------------------------------------
CONFIG_TINYUSB_ENABLED=y
# Use CDC-ECM + RNDIS composite device (Windows gets RNDIS, Linux gets ECM)
CONFIG_TINYUSB_NET_ENABLED=y
# Disable unused TinyUSB classes to save flash
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_HID_ENABLED=n
CONFIG_TINYUSB_MSC_ENABLED=n
CONFIG_TINYUSB_DFU_ENABLED=n
CONFIG_TINYUSB_MIDI_ENABLED=n

# ---------------------------------------------------------------------------
# WiFi
# ---------------------------------------------------------------------------
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# ---------------------------------------------------------------------------
# lwIP — enable NAPT so the ESP32 can route between USB-NIC and WiFi STA
# ---------------------------------------------------------------------------
CONFIG_LWIP_IP_NAPT=y
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_IPV4_NAPT_PORTMAP=y

# ---------------------------------------------------------------------------
# NVS
# ---------------------------------------------------------------------------
CONFIG_NVS_ENCRYPTION=n

# ---------------------------------------------------------------------------
# OTA / Rollback
# ---------------------------------------------------------------------------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---------------------------------------------------------------------------
# Logging (reduce verbosity in production)
# ---------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
